# 觅食 Food 遇到人类 Human 繁殖 Breed 朋友 Friend 朋友礼物 Gift 死亡事件 Death 结束语 Endtext
# 初始技能和出生事件待补充

Friend = {
    101: {"name": "黄眉柳莺", "tasty": 0, "gift": 1},
    102: {"name": "乌灰鸫", "tasty": 0, "gift": 2},
    103: {"name": "游隼", "tasty": 1, "fight": [8, 8, 8]},
    104: {"name": "黄眉鹀", "tasty": 0, "gift": 3},
    105: {"name": "黑枕黄鹂", "tasty": 0, "gift": 3},
    106: {"name": "黄眉姬鹟", "tasty": 0, "gift": 4},
    107: {"name": "黄腰柳莺", "tasty": 0, "gift": 1},
    108: {"name": "池鹭", "tasty": 0, "gift": 4},
    109: {"name": "鳞头树莺", "tasty": 0, "gift": 5},
    110: {"name": "白腹蓝鹟", "tasty": 0, "gift": 6},
    111: {"name": "紫寿带", "tasty": 0, "gift": 5},
    112: {"name": "红尾歌鸲", "tasty": 0, "gift": 5},
    113: {"name": "灰鹡鸰", "tasty": 0, "gift": 2},
    114: {"name": "白眉姬鹟", "tasty": 0, "gift": 3},
    115: {"name": "黄鹡鸰", "tasty": 0, "gift": 3},
    116: {"name": "黑头蜡嘴雀", "tasty": 0, "gift": 2},
    117: {"name": "火斑鸠", "tasty": 0, "gift": 2},
    118: {"name": "普通夜鹰", "tasty": 0, "gift": 5},
    119: {"name": "白眉鹀", "tasty": 0, "gift": 4},
    120: {"name": "红喉姬鹟", "tasty": 0, "gift": 5},
    121: {"name": "黄雀", "tasty": 0, "gift": 3},
    122: {"name": "铜蓝鹟", "tasty": 0, "gift": 6},
    123: {"name": "鹗", "tasty": 1, "fight": [10, 10, 10]},
    124: {"name": "日本松雀鹰", "tasty": 1, "fight": [6, 6, 6]},
    125: {"name": "小蝗莺", "tasty": 0, "gift": 5},
    126: {"name": "燕雀", "tasty": 0, "gift": 5},
}

Gift = {
    1: {"text": " 一根美丽的绿色羽毛 —— 经验+2", "effect": {"exp": 2}},
    2: {"text": " 一根朴素的灰色羽毛 —— 经验+1", "effect": {"exp": 1}},
    3: {"text": " 一根鲜艳的黄色羽毛 —— 战斗属性-敏捷+2", "effect": {"dex": 2}},
    4: {"text": " 一根闪亮的白色羽毛 —— 战斗属性-智慧+2", "effect": {"wis": 2}},
    5: {"text": " 一根柔软的棕色羽毛 —— 战斗属性-力量+2", "effect": {"str": 2}},
    6: {"text": " 一根鲜艳的蓝色羽毛 —— 焕发青春！年龄-1", "effect": {"age": -1}},
}

Food = {
    1: {"text": "找到很多美味的{}！（食物+3）", "effect": {"food": 3}},
    2: {"text": "找到少量{}。（食物+1）", "effect": {"food": 1}},
    3: {"text": "没找到食物。", "effect": {"food": 0}},
    4: {"text": "找到一些{}，但被其他鸟抢走了。（食物-1）", "effect": {"food": -1}},
}

Human = {
    1: {"text": "受伤了，被人类救助"},
    2: {"text": "想起自己小时候调皮跑出了巢，被好心人塞回了巢里的经历"},
    3: {"text": "被猫狗抓住，幸好主人及时管教宠物放走了我"},
    4: {"text": "被盗猎者抓住，幸好警察及时放走了我"},
    5: {"text": "闯进建筑物找不到出口，被好心人扔了出去"},
    6: {"text": "撞上玻璃懵逼了，被好心人保护到恢复清醒"},
    7: {"text": "我粘到了粘鼠板上，被好心人清洗干净放走"},
}

Breed = {
    101: {"text": "我不够有魅力，被异性拒绝"},
    102: {"text": "我没有足够的繁殖经验"},
    201: {"text": "我的蛋被蛇捕食"},
    202: {"text": "我的蛋被赤腹松鼠捕食"},
    203: {"text": "我患有天生或后天疾病"},
    204: {"text": "我的巢穴被不文明的人类不断围观拍摄，我因为害怕而弃巢"},
    301: {"text": "我巢穴的遮蔽物被不文明的摄影者剪去，雏鸟被风吹雨淋而死"},
    302: {"text": "我的雏鸟被猛禽捕食"},
    303: {"text": "我的雏鸟被盗猎者掏窝"},
    304: {"text": "我的雏鸟被流浪猫杀死"},
    401: {"text": "我生活拮据，无法养活雏鸟"},
}

Death = {
    101: {"name": "凤头鹰", "fight": [8, 8, 8]},
    102: {"name": "红隼", "fight": [8, 8, 8]},
    103: {"name": "黄鼬", "fight": [6, 6, 6]},
    201: {"name": "流浪猫", "target": 4},
    202: {"name": "盗猎者弹弓", "target": 5},
    203: {"name": "盗猎者雾网", "target": 5},
    204: {"name": "玻璃", "target": 4},
    301: {
        "name": "疾病",
        "success": "一种未知的疾病在我的族群中传播，幸好我体质不错，很快康复了。",
        "fail": "一种未知的疾病在我的族群中传播，我倒下了。",
    },
    302: {
        "name": "衰老",
        "success": "寒风瑟瑟，衰老带走了我的长辈，我不知道它何时会带走我...",
        "fail": "寒风瑟瑟，我感到衰老和疲倦，我知道自己大限将至。",
    },
}

Fight = {
    1: {"text": "{}对我摆出了捕猎姿态！", "力量": "冲上去攻击", "敏捷": "加速逃跑", "智慧": "伪装隐蔽"},
    2: {"text": "{}快速向我冲来！", "力量": "正面回击", "敏捷": "闪避", "智慧": "找掩蔽物躲藏"},
    3: {"text": "{}的利爪捉住了我！", "力量": "用力挣脱", "敏捷": "攻击对方要害", "智慧": "跟它讲道理"},
    11: {
        "win": "被我打得措手不及，落荒而逃",
        "favoured": "被我打乱了进攻节奏",
        "ill-favoured": "趁机拉近了与我的距离",
        "lose": "被我的挑衅激怒",
    },
    12: {
        "win": "被我甩得很远",
        "favoured": "与我拉开了一段距离",
        "ill-favoured": "速度更胜于我",
        "lose": "轻松追上了我",
    },
    13: {
        "win": "完全找不到我的踪迹",
        "favoured": "被我的行动迷惑",
        "ill-favoured": "发现了我的踪迹",
        "lose": "迅速看穿了我的伪装",
    },
    21: {
        "win": "被我的气势震慑",
        "favoured": "的攻击有所迟疑",
        "ill-favoured": "的攻击似乎不受影响",
        "lose": "被我的挑衅激怒",
    },
    22: {
        "win": "觉得我太灵活，不好下手",
        "favoured": "被我的动作干扰判断",
        "ill-favoured": "比我更灵活",
        "lose": "精准预判了我的路线",
    },
    23: {
        "win": "追踪我时被其他猎物吸引了注意",
        "favoured": "花了一些时间寻找",
        "ill-favoured": "是躲猫猫高手",
        "lose": "悄悄地出现在我背后",
    },
    31: {
        "win": "在打斗中消耗了过多体力",
        "favoured": "稍稍放松了控制",
        "ill-favoured": "越抓越紧",
        "lose": "在打斗中刺穿了我的喉咙",
    },
    32: {
        "win": "露出痛苦的表情",
        "favoured": "做出防御的动作",
        "ill-favoured": "似乎不受影响",
        "lose": "被我的挑衅激怒",
    },
    33: {
        "win": "被我打动，决定放我一马",
        "favoured": "认真思考我说的话",
        "ill-favoured": "听不懂我说话",
        "lose": "最讨厌花言巧语的猎物",
    },
}

Endtext = [
    "下一次，我会是谁呢？",
    "我度过了精彩的一生。",
    "我度过了有趣的一生。",
    "下一次，我会经历怎样的故事呢？",
    "再见！",
    "希望有谁会记得我。",
]
